In [23]:
import pandas as pd
import sqlite3

In [24]:
df=pd.read_csv('pamefeed.csv')
df

,created_at,entry_id,field1,field2,field3,field4,Place,Location,elevation,status
0,2024-04-03T12:22:57+00:00,2,"lat:8.501768,long:76.967353",193,187.127031,6862.837622,Thiruvananthapuram,/static/pothole/img1.jpg,NaN,NaN
1,2024-04-18T07:05:44+00:00,3,"lat:8.518357,long:76.950710",176,171.883246,5964.687390,Thiruvananthapuram,/static/pothole/img2.jpg,NaN,NaN

In [35]:
def store_data_to_sqlite(data):
    """Stores data into SQLite database."""
    db_file = 'places.db'
    conn = sqlite3.connect(db_file)
    cursor = conn.cursor()
    cursor.execute('''CREATE TABLE IF NOT EXISTS places
                      (id INTEGER PRIMARY KEY AUTOINCREMENT, 
                       name REAL, details REAL, image REAL)''')
    
    # Insert data
    for i in range(len(data)):
        loc=df.loc[i]['field1']
        dis= float(df.loc[i]['field2'])/100
        cam_dis= float(df.loc[i]['field3'])/100
        area= float(df.loc[i]['field4'])/10000
        volume=area*(dis-cam_dis+2)
        cost=volume*3400
        place=df.loc[i]['Place']
        img_loc=df.loc[i]['Location']
        text=f'Location:{loc},area:{area} sqcm,volume:{volume} cubic meter,cost:{cost} Rs'
        cursor.execute('INSERT INTO places (name, details, image) VALUES (?, ?, ?)',
                       (place, text,img_loc))
    
    conn.commit()
    cursor.close()
    conn.close()

In [36]:
store_data_to_sqlite(df)